using Microsoft.EntityFrameworkCore.Migrations;

namespace SDLCSimulator_Data.Migrations
{
    public partial class AddAnotherTask : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "Task",
                columns: new[] { "Id", "Description", "Difficulty", "ErrorRate", "MaxGrade", "Standard", "TeacherId", "Topic", "Type" },
                values: new object[] { 2, "{\"Columns\":[\"Вимоги до системи автозаправної станції\",\"Вимоги до сервісу пошуку та порівняння цін на товари інтернет-магазинів\",\"Вимоги до системи обліку роботи магазину будівельних матеріалів\"],\"Blocks\":[\"Можливість додавання нових палив/сервісів/продуктів\",\"Можливість пошуку автозаправної станції з необхідним паливом та сервісами\",\"Можливість накопичувати бонусні бали та витрачати їх при купівлі товарів інтернет-магазинів\",\"Наявність способу оформлення автоцивілки онлайн з отриманням на певній АЗС\",\"Можливість перегляду онлайн трансляції території АЗС у браузері\",\"Можливість оформлення замовлення будівельних матеріалів для клієнта\",\"Можливість подивитися наявні зображення та відеоматеріали стосовно товару інтернет-магазину\",\"Експорт інформації про товари інтернет-магазинів на платформу\",\"Можливість обліку заробітної плати працівників магазину будівельних матеріалів\",\"Можливість перегляду історії цін на товар інтернет-магазину\",\"Можливість оформлення замовлення на постачання будівельних матеріалів\",\"Можливість пошуку та фільтрації будівельних матеріалів\",\"Можливість внесення та редагування даних про постійних клієнтів магазину будівельних матеріалів\",\"Можливість придбання обраного товару інтернет-магазину\",\"Можливість редагування списку акцій/новин на сайті АЗС\",\"Додавання будівельного матеріалу в систему\",\"Можливість завантаження файлів в систему АЗС\",\"Можливість залишання відгуку про інтернет-магазин\"]}", 3, 2, 60, "{\"StandardOrResult\":{\"Вимоги до системи автозаправної станції\":[\"Можливість перегляду онлайн трансляції території АЗС у браузері\",\"Можливість додавання нових палив/сервісів/продуктів\",\"Можливість пошуку автозаправної станції з необхідним паливом та сервісами\"],\"Вимоги до сервісу пошуку та порівняння цін на товари інтернет-магазинів\":[\"Можливість придбання обраного товару інтернет-магазину\",\"Можливість перегляду історії цін на товар інтернет-магазину\",\"Експорт інформації про товари інтернет-магазинів на платформу\"],\"Вимоги до системи обліку роботи магазину будівельних матеріалів\":[\"Можливість оформлення замовлення будівельних матеріалів для клієнта\",\"Можливість пошуку та фільтрації будівельних матеріалів\",\"Можливість оформлення замовлення на постачання будівельних матеріалів\"]}}", 2, "Вибір найважливіших вимог для декількох систем", 2 });

            migrationBuilder.InsertData(
                table: "GroupTask",
                columns: new[] { "GroupId", "TaskId" },
                values: new object[] { 1, 2 });
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "GroupTask",
                keyColumns: new[] { "GroupId", "TaskId" },
                keyValues: new object[] { 1, 2 });

            migrationBuilder.DeleteData(
                table: "Task",
                keyColumn: "Id",
                keyValue: 2);
        }
    }
}
