using System.Collections.Generic;
using SDLCSimulator_BusinessLogic.Models.Input;

namespace SDLCSimulator_Common.Fixtures
{
    public static class CreateTaskResultInputFixture
    {
        public static CreateTaskResultInput CreateRequirementsTypeAndOrderByImportanceTaskResult()
        {
            return new()
            {
                TaskId = 1,
                ErrorCount = 2,
                Result = new()
                {
                    StandardOrResult = new()
                    {
                        {
                            "Функціональні",
                            new List<string>
                            {
                                "Перегляд вмісту кошику","Вибір способу доставки","Пошук товарів за назвою",
                                "Наявність вбудованого графічного редактору",
                                "Наявність сторінки оформлення замовлення реклами"
                            }
                        },

                        {
                            "Нефункціональні",
                            new List<string>
                            {
                                "З’єднання з сайтом відбувається на основі протоколу HTTPS",
                                "Блокування облікового запису у разі підозрілої поведінки",
                                "Програмний продукт буде пов’язаний з поштовим клієнтом MS Outlook для отримання розсилки електронних повідомлень",
                                "Користувацький інтерфейс має відповідати 10 евристикам графічного інтерфейсу",
                                "Програмний продукт має витримувати мінімум 100 запитів до серверу на секунду"
                            }
                        }
                    }
                }
            };
        }

        public static CreateTaskResultInput CreateZeroFinalMarkRequirementsTypeAndOrderByImportanceTaskResult()
        {
            return new()
            {
                TaskId = 1,
                ErrorCount = 2,
                Result = new()
                {
                    StandardOrResult = new()
                    {
                        {
                            "Функціональні",
                            new List<string>
                            {
                                "Вибір способу доставки", "Перегляд вмісту кошику",
                                "Наявність сторінки оформлення замовлення реклами", "Наявність вбудованого графічного редактору",
                                "Пошук товарів за назвою"
                            }
                        },

                        {
                            "Нефункціональні",
                            new List<string>
                            {                                
                                "Блокування облікового запису у разі підозрілої поведінки",
                                "З’єднання з сайтом відбувається на основі протоколу HTTPS",
                                "Програмний продукт буде пов’язаний з поштовим клієнтом MS Outlook для отримання розсилки електронних повідомлень",
                                "Користувацький інтерфейс має відповідати 10 евристикам графічного інтерфейсу",
                                "Програмний продукт має витримувати мінімум 100 запитів до серверу на секунду"
                            }
                        }
                    }
                }
            };
        }

        public static CreateTaskResultInput CreateSystemsTypeAndFindMostImportantTaskResult()
        {
            return new()
            {
                TaskId = 2,
                ErrorCount = 3,
                Result = new()
                {
                    StandardOrResult = new()
                    {
                        {
                            "Вимоги до системи автозаправної станції",
                            new List<string>
                            {
                                "Можливість перегляду онлайн трансляції території АЗС у браузері", 
                                "Можливість додавання нових палив/сервісів/продуктів",
                                "Можливість перегляду онлайн трансляції території АЗС у браузері"
                            }
                        },

                        {
                            "Вимоги до сервісу пошуку та порівняння цін на товари інтернет-магазинів",
                            new List<string>
                            {
                                "Можливість придбання обраного товару інтернет-магазину", 
                                "Можливість перегляду історії цін на товар інтернет-магазину",
                                "Експорт інформації про товари інтернет-магазинів на платформу"
                            }
                        },

                        {
                            "Вимоги до системи обліку роботи магазину будівельних матеріалів",
                            new List<string>
                            {
                                "Можливість оформлення замовлення на постачання будівельних матеріалів",
                                "Можливість внесення та редагування даних про постійних клієнтів магазину будівельних матеріалів",
                                "Можливість обліку заробітної плати працівників магазину будівельних матеріалів"
                            }
                        }
                    }
                }
            };
        }

        public static CreateTaskResultInput CreateZeroFinalMarkSystemsTypeAndFindMostImportantTaskResult()
        {
            return new()
            {
                TaskId = 2,
                ErrorCount = 3,
                Result = new()
                {
                    StandardOrResult = new()
                    {
                        {
                            "Вимоги до системи автозаправної станції",
                            new List<string>
                            {
                                "Можливість завантаження файлів в систему АЗС",
                                "Наявність способу оформлення автоцивілки онлайн з отриманням на певній АЗС",
                                "Можливість редагування списку акцій/новин на сайті АЗС"
                            }
                        },

                        {
                            "Вимоги до сервісу пошуку та порівняння цін на товари інтернет-магазинів",
                            new List<string>
                            {
                                "Можливість подивитися наявні зображення та відеоматеріали стосовно товару інтернет-магазину",
                                "Можливість накопичувати бонусні бали та витрачати їх при купівлі товарів інтернет-магазинів",
                                "Можливість залишання відгуку про інтернет-магазин"
                            }
                        },

                        {
                            "Вимоги до системи обліку роботи магазину будівельних матеріалів",
                            new List<string>
                            {
                                "Додавання будівельного матеріалу в систему",
                                "Можливість внесення та редагування даних про постійних клієнтів магазину будівельних матеріалів",
                                "Можливість обліку заробітної плати працівників магазину будівельних матеріалів"
                            }
                        }
                    }
                }
            };
        }
    }
}
